params = struct('mu',398600.4416, ... % км^3/c^2, грав параметр
                'i',pi/6, ... % рад, наклонение
                'e',0.5, ... % эксцентриситет
                'p',5000, ... % км, фокальный параметр
                'Omega',pi/4, ... % рад, долгота восходящего узла
                'omega',pi/3,... % рад, аргумент перицентра
                'delta',2.6323e10); % коэффициент для гармоники J2
[r0, v0] = elem2xyz(params.i,params.e,params.p,params.Omega,params.omega,0,params.mu);
x_START = [r0;  % радиус-вектор, км
           v0]; % скорость, км/с
T = 1e5; % с
dt = 0.5;